load-test/artillery.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://alibaba.prinafsika.world
  phases:
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: Warm up the API
    - duration: 60
      arrivalRate: 10
      rampTo: 50
      name: Ramp up to peak load
    - duration: 300
      arrivalRate: 50
      name: Sustained peak load
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75
scenarios:
  - flow:
      - loop:
          - get:
            url: '/'
    count: 100